"""이것은 함수를 이용한 퀴즈입니다."""

score=0
q1=['''
1. 번 문제 1+1
    1) 1
    2) 2
    3) 3
    4) 4
      ''','''
2. 번 문제 100+314
    1) 214
    2) 314
    3) 414
    4) 514
      ''','''
3. 번 문제 123+123
    1) 214
    2) 314
    3) 414
    4) 246
      ''','''
4. 번 문제 5324+1234
    1) 6558
    2) 3124
    3) 6414
    4) 6514
      ''','''
5. 번 문제 123*8
    1) 984
    2) 321
    3) 531
    4) 321
      ''' ]
q2=[2, 3, 4, 1, 1]

def clac(answer, sol):
    global score
    if answer == sol:-
        score = score + 1
        print('정답입니다.')
    else:
        print('오답입니다.')
    return


for i in range(0, 5):
    print(q1[i])
    clac(int(input()), q2[i])
    print(score)
